---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.BuildingCurveGstylePlusInvisible
source: html/639cfca2-a18c-bee4-bb50-a5b560b10d32.htm
---
# Autodesk.Revit.DB.ParameterTypeId.BuildingCurveGstylePlusInvisible Property

"Subcategory"

## Syntax (C#)
```csharp
public static ForgeTypeId BuildingCurveGstylePlusInvisible { get; }
```